app/views/restaurants/index.html.erb

SELECT "restaurants".* FROM "restaurants"
---
          <h5>Restaurants</h5>
            <% current_user.restaurants.each do |restaurant| %>