app/views/restaurants/show.html.erb

SELECT "reviews".* FROM "reviews" WHERE "reviews"."restaurant_id" = $1  [["restaurant_id", 1]]
SELECT COUNT(*) FROM "reviews" WHERE "reviews"."restaurant_id" = $1  [["restaurant_id", 1]]
---

    <h3>Reviews<h5>(Count: <%= @restaurant.reviews.count %> | Avg Score: <%= @restaurant.average_review %> )  </h5></h3>