app/controllers/users_controller.rb

INSERT INTO "users" ("username", "email", "password_digest", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["username", "adamjweil"], ["email", "adam@adam.com"], ["password_digest", "password"], ["created_at", "2017-10-20 19:30:40.721872"], ["updated_at", "2017-10-20 19:30:40.721872"]]
---
  def create
    @user = User.new(user_params)

    # respond_to do |format|
      if @user.save